Repository: Mawadda-Kadi/protfolio-mawadda
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: de

source: Full Stack Web Developer. Skilled in everything from HTML to Heroku. The capacity for structural and design thinking.
de: Full Stack Web Entwicklerin mit Fähigkeiten in allem von HTML bis Heroku. Starke analytische und kreative Denkweise.

source: I use programming languages such as HTML, CSS and SASS, JavaScript, and TypeScript, along with frameworks like React and Next.js for front-end development. For back-end development and data analysis, I work with Python, PHP, Laravel, Java, Django, and Flask. A great user experience is created through effective design, along with optimized application speed, security, and reliability.
de: Ich verwende Programmiersprachen wie HTML, CSS, SASS, JavaScript und TypeScript sowie Frameworks wie React und Next.js für die Frontend-Entwicklung. Für das Backend nutze ich Python, PHP, Laravel, Java, Django und Flask. Eine großartige Nutzererfahrung entsteht durch ein durchdachtes Design sowie optimierte Geschwindigkeit, Sicherheit und Zuverlässigkeit.

source: I am highly motivated to learn and apply new skills, bringing fresh ideas and enthusiasm to your team. My unique combination of full stack development and data analysis expertise allows me to approach problems from multiple angles, providing well-rounded solutions. I can also work independently to ensure these qualities are consistently met.
de: Ich bin hochmotiviert, neue Fähigkeiten zu erlernen und anzuwenden, um frische Ideen und Begeisterung in Ihr Team zu bringen. Meine Kombination aus Full Stack Entwicklung und Datenanalyse ermöglicht es mir, Probleme aus verschiedenen Blickwinkeln zu betrachten und umfassende Lösungen zu bieten. Zudem arbeite ich eigenständig und zuverlässig.

source: It is a front-end portfolio website built with Next.js, React, TypeScript, and SASS. Designed for a professional photographer, the site showcases event photography with an elegant UI, interactive galleries, and a responsive layout for an immersive viewing experience.
de: Es ist eine Frontend-Portfolio-Website, die mit Next.js, React, TypeScript und SASS entwickelt wurde. Die Website wurde für eine professionelle Fotografin entworfen und präsentiert Eventfotografie mit einer eleganten Benutzeroberfläche, interaktiven Galerien und einem responsiven Layout für ein immersives Seherlebnis.

source: It is a full-stack web application built with Laravel, PHP, HTML, CSS (SASS), and JavaScript. The app allows users to take quizzes in various categories, track scores, and compete on a leaderboard. It features real-time feedback, authentication, and a responsive design for an engaging quiz experience.
de: Es ist eine Full-Stack-Webanwendung, die mit Laravel, PHP, HTML, CSS (SASS) und JavaScript entwickelt wurde. Die App ermöglicht es Benutzern, Quizfragen in verschiedenen Kategorien zu beantworten, Punkte zu verfolgen und auf einer Bestenliste zu konkurrieren. Sie bietet Echtzeit-Feedback, Authentifizierung und ein responsives Design für ein interaktives Quiz-Erlebnis.

source: It is a front-end web game built with HTML, CSS, and JavaScript. The game allows users to generate Bingo cards, draw numbers, and check for winning conditions. It includes text-to-speech announcements and a mute option for accessibility.
de: Es ist ein Frontend-Webspiel, das mit HTML, CSS und JavaScript entwickelt wurde. Das Spiel ermöglicht es den Benutzern, Bingokarten zu generieren, Zahlen zu ziehen und Gewinnbedingungen zu überprüfen. Es enthält Sprachausgabe und eine Stummschaltoption für Barrierefreiheit.

source: It is a machine learning project designed to predict whether a cherry leaf is infected with powdery mildew using image analysis. This Python-based project utilizes Jupyter Notebook, Streamlit, NumPy, Pandas, TensorFlow and more.
de: Es ist ein Machine-Learning-Projekt zur Vorhersage, ob ein Kirschblatt mit Mehltau infiziert ist, basierend auf Bildanalyse. Dieses Python-basierte Projekt verwendet Jupyter Notebook, Streamlit, NumPy, Pandas, TensorFlow und mehr.

source: It is an online marketplace for vintage and second-hand goods where users can buy and sell items. Built using Python, HTML, CSS, and JavaScript, it leverages Django as its primary framework, Bootstrap, PostgreSQL and Cloudinary.
de: Es ist ein Online-Marktplatz für Vintage- und Second-Hand-Artikel, auf dem Benutzer Waren kaufen und verkaufen können. Entwickelt mit Python, HTML, CSS und JavaScript, verwendet es Django als Hauptframework, sowie Bootstrap, PostgreSQL und Cloudinary.

source: It is a Python-based project designed to collect and analyze survey data related to remote working. Utilizing the Google Sheets API for data storage and management, and incorporating statistical analysis with the SciPy library.
de: Es ist ein Python-basiertes Projekt zur Erfassung und Analyse von Umfragedaten zum Thema Fernarbeit. Es nutzt die Google Sheets API zur Datenspeicherung und -verwaltung und integriert statistische Analysen mit der SciPy-Bibliothek.

source: It is a front-end mini-game using HTML, CSS, and JavaScript. The user-centric design and functionality provide an engaging and intuitive experience for players, encouraging them to exercise memory skills and enjoy the challenge of the memory card game.
de: Es ist ein Frontend-Minispiel, das HTML, CSS und JavaScript verwendet. Das benutzerfreundliche Design und die Funktionalität bieten ein unterhaltsames und intuitives Spielerlebnis, das die Gedächtnisfähigkeiten fördert und die Herausforderung eines Gedächtnisspiels bietet.

source: It is a front-end project using only HTML and CSS. The website is structured with clear sections for Home, Events, Resources, and Find Us, prioritizing user engagement, accessibility, and a visually appealing experience that aligns with the community's values.
de: Es ist ein Frontend-Projekt, das nur HTML und CSS verwendet. Die Website ist mit klaren Abschnitten für Startseite, Veranstaltungen, Ressourcen und Standortinformationen strukturiert und legt den Fokus auf Benutzerfreundlichkeit, Barrierefreiheit und ein visuell ansprechendes Design, das mit den Werten der Community übereinstimmt.

source: I possess strong front-end development skills, including HTML, CSS, JavaScript, and TypeScript. I am experienced with frameworks such as React and Next.js for building dynamic and interactive web applications. Additionally, I use SASS for enhanced styling and Bootstrap for responsive design, enabling me to create visually appealing and functional user interfaces.
de: Ich verfüge über fundierte Kenntnisse in der Frontend-Entwicklung, einschließlich HTML, CSS, JavaScript und TypeScript. Ich habe Erfahrung mit Frameworks wie React und Next.js zur Erstellung dynamischer und interaktiver Webanwendungen. Außerdem verwende ich SASS für erweiterte Gestaltungsmöglichkeiten und Bootstrap für ein responsives Design, wodurch ich visuell ansprechende und funktionale Benutzeroberflächen gestalten kann.

source: I specialize in developing data-driven web applications, focusing on utilizing document-based data. My back-end skills include using Python with Flask and Django, as well as PHP with Laravel for robust web development. I also have experience with Java for back-end programming. Additionally, I work with relational databases such as SQL and PostgreSQL (PgSQL) for efficient data management, along with data analysis tools like Pandas and NumPy to process and present information effectively.
de: Ich bin auf die Entwicklung datengetriebener Webanwendungen spezialisiert, wobei ich mich auf die Nutzung dokumentenbasierter Daten konzentriere. Zu meinen Backend-Fähigkeiten gehören die Verwendung von Python mit Flask und Django sowie von PHP mit Laravel für eine robuste Webentwicklung. Außerdem habe ich Erfahrung mit Java für die Backend-Programmierung. Zusätzlich arbeite ich mit relationalen Datenbanken wie SQL und PostgreSQL (PgSQL) für eine effiziente Datenverwaltung sowie mit Datenanalysetools wie Pandas und NumPy, um Informationen effektiv zu verarbeiten und zu präsentieren.

source: Full Stack Developer
de: Full Stack Entwicklerin

source: Home
de: Startseite

source: Resume
de: Lebenslauf

source: My Projects
de: Meine Projekte

source: Contact
de: Kontakt

source: About
de: Über mich

source: Download
de: Herunterladen

source: Need a printable version of my CV? Download it here.
de: Benötigen Sie eine druckbare Version meines Lebenslaufs? Laden Sie ihn hier herunter.

source: Social
de: Soziale Netzwerke

source: Got a project in mind?
de: Haben Sie ein Projekt im Kopf?

source: Let's work together!
de: Lassen Sie uns zusammenarbeiten!

source: Project description
de: Projektbeschreibung

source: Send Project Request
de: Projektanfrage senden

source: Personal Info
de: Persönliche Informationen

source: Address:
de: Adresse:

source: Phone:
de: Telefon:

source: About Me
de: Über mich

source: What do I do?
de: Was mache ich?

source: How do I do it?
de: Wie mache ich das?

source: Why hire me?
de: Warum sollten Sie mich einstellen?

source: Frozen Moments Portfolio Image
de: Bild des Frozen Moments Portfolios

source: View Site
de: Seite anzeigen

source: Quiz App Game Image
de: Bild der Quiz-App

source: Bing Card Game Image
de: Bild des Bingo-Kartenspiels

source: Bingo Card Game
de: Bingo-Kartenspiel

source: Mildew Detection in Cherry Leaves Website Image
de: Bild der Mehltauerkennung bei Kirschblättern

source: Mildew Detection in Cherry Leaves
de: Mehltauerkennung bei Kirschblättern

source: Altliebe Website Image
de: Bild der Altliebe-Website

source: Remote Working Survey Image
de: Bild der Fernarbeitsumfrage

source: Remote Working Survey
de: Fernarbeitsumfrage

source: Card Game Image
de: Bild des Kartenspiels

source: Card Memory Game
de: Kartengedächtnisspiel

source: LGBTQ Club Website Image
de: Bild der LGBTQ-Club-Website

source: My History
de: Meine Geschichte

source: Completed an internship
de: Ein Praktikum abgeschlossen

source: Attended an online course in Full Stack Development
de: Einen Online-Kurs in Full Stack Development absolviert

source: Attended a German language course from A1 to C1
de: Einen Deutschkurs von A1 bis C1 absolviert

source: Worked as an emergency call operator
de: Als Notrufdisponentin gearbeitet

source: Administrative Assistant in the Quality Control Department
de: Verwaltungsassistentin in der Qualitätskontrolle

source: My Skills
de: Meine Fähigkeiten

source: As a beginner in full stack development, I can create and manage web applications, handling both front-end and back-end tasks. Additionally, I specialize in data analysis, enabling me to extract meaningful insights and present them effectively.
de: Als Anfängerin im Full Stack Development kann ich Webanwendungen erstellen und verwalten, sowohl im Front-End als auch im Back-End. Zudem bin ich auf Datenanalyse spezialisiert und kann wertvolle Erkenntnisse gewinnen und präsentieren.
